#language:zh-TW
功能: 購物車

如果會員在購買商品之後，可以快速計算折扣金額和總價錢

根據會員的等級，提供不同的折扣

* VIP 會員，滿 500 元，打 8 折
* 一般會員滿 1000 元，且超過 3 件商品，才打 85 折

場景: VIP 會員，購買 200 元商品 3 件，總金額為 480 元
  假設 使用者進入購物車
  並且 商品價格為 "200" 元
  並且 商品數量為 "3" 件
  並且 會員等級為 "VIP"
  當 進行結帳
  那麼 總金額為 "480" 元

場景: VIP 會員，購買 200 元商品 2 件，總金額為 400 元
  假設 使用者進入購物車
  並且 商品價格為 "200" 元
  並且 商品數量為 "2" 件
  並且 會員等級為 "VIP"
  當 進行結帳
  那麼 總金額為 "400" 元

場景: Normal 會員，購買 200 元商品 3 件，總金額為 600 元
  假設 使用者進入購物車
  並且 商品價格為 "200" 元
  並且 商品數量為 "3" 件
  並且 會員等級為 "Normal"
  當 進行結帳
  那麼 總金額為 "600" 元

場景: Normal 會員，購買 200 元商品 6 件，總金額為 1020 元
  假設 使用者進入購物車
  並且 商品價格為 "200" 元
  並且 商品數量為 "6" 件
  並且 會員等級為 "Normal"
  當 進行結帳
  那麼 總金額為 "1020" 元

場景: Normal 會員，購買 600 元商品 2 件，總金額為 1200 元
  假設 使用者進入購物車
  並且 商品價格為 "600" 元
  並且 商品數量為 "2" 件
  並且 會員等級為 "Normal"
  當 進行結帳
  那麼 總金額為 "1200" 元
